{
  "config": [
    {
      "config": {
        "function_type": "lambda",
        "input_dtype": "float32",
        "output_shape_type": "raw",
        "batch_input_shape": [
          null,
          64,
          64,
          3
        ],
        "output_shape": null,
        "arguments": {},
        "trainable": true,
        "function": [
          "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>Y\u0000\u0000\u0000s\u0000\u0000\u0000\u0000",
          null,
          null
        ],
        "name": "lambda_1"
      },
      "class_name": "Lambda"
    },
    {
      "config": {
        "W_constraint": null,
        "bias": true,
        "subsample": [
          1,
          1
        ],
        "nb_filter": 24,
        "b_regularizer": null,
        "trainable": true,
        "dim_ordering": "tf",
        "activity_regularizer": null,
        "init": "glorot_uniform",
        "nb_col": 5,
        "activation": "relu",
        "W_regularizer": {
          "l1": 0.0,
          "l2": 0.0010000000474974513,
          "name": "L1L2Regularizer"
        },
        "nb_row": 5,
        "border_mode": "valid",
        "b_constraint": null,
        "name": "convolution2d_1"
      },
      "class_name": "Convolution2D"
    },
    {
      "config": {
        "pool_size": [
          2,
          2
        ],
        "trainable": true,
        "border_mode": "valid",
        "dim_ordering": "tf",
        "strides": [
          2,
          2
        ],
        "name": "maxpooling2d_1"
      },
      "class_name": "MaxPooling2D"
    },
    {
      "config": {
        "W_constraint": null,
        "bias": true,
        "subsample": [
          1,
          1
        ],
        "nb_filter": 36,
        "b_regularizer": null,
        "trainable": true,
        "dim_ordering": "tf",
        "activity_regularizer": null,
        "init": "glorot_uniform",
        "nb_col": 5,
        "activation": "relu",
        "W_regularizer": {
          "l1": 0.0,
          "l2": 0.0010000000474974513,
          "name": "L1L2Regularizer"
        },
        "nb_row": 5,
        "border_mode": "valid",
        "b_constraint": null,
        "name": "convolution2d_2"
      },
      "class_name": "Convolution2D"
    },
    {
      "config": {
        "W_constraint": null,
        "bias": true,
        "subsample": [
          1,
          1
        ],
        "nb_filter": 48,
        "b_regularizer": null,
        "trainable": true,
        "dim_ordering": "tf",
        "activity_regularizer": null,
        "init": "glorot_uniform",
        "nb_col": 3,
        "activation": "relu",
        "W_regularizer": {
          "l1": 0.0,
          "l2": 0.0010000000474974513,
          "name": "L1L2Regularizer"
        },
        "nb_row": 3,
        "border_mode": "valid",
        "b_constraint": null,
        "name": "convolution2d_3"
      },
      "class_name": "Convolution2D"
    },
    {
      "config": {
        "W_constraint": null,
        "bias": true,
        "subsample": [
          1,
          1
        ],
        "nb_filter": 64,
        "b_regularizer": null,
        "trainable": true,
        "dim_ordering": "tf",
        "activity_regularizer": null,
        "init": "glorot_uniform",
        "nb_col": 3,
        "activation": "relu",
        "W_regularizer": {
          "l1": 0.0,
          "l2": 0.0010000000474974513,
          "name": "L1L2Regularizer"
        },
        "nb_row": 3,
        "border_mode": "valid",
        "b_constraint": null,
        "name": "convolution2d_4"
      },
      "class_name": "Convolution2D"
    },
    {
      "config": {
        "W_constraint": null,
        "bias": true,
        "subsample": [
          1,
          1
        ],
        "nb_filter": 64,
        "b_regularizer": null,
        "trainable": true,
        "dim_ordering": "tf",
        "activity_regularizer": null,
        "init": "glorot_uniform",
        "nb_col": 3,
        "activation": "relu",
        "W_regularizer": {
          "l1": 0.0,
          "l2": 0.0010000000474974513,
          "name": "L1L2Regularizer"
        },
        "nb_row": 3,
        "border_mode": "valid",
        "b_constraint": null,
        "name": "convolution2d_5"
      },
      "class_name": "Convolution2D"
    },
    {
      "config": {
        "name": "flatten_1",
        "trainable": true
      },
      "class_name": "Flatten"
    },
    {
      "config": {
        "W_constraint": null,
        "bias": true,
        "b_regularizer": null,
        "trainable": true,
        "activation": "relu",
        "init": "glorot_uniform",
        "input_dim": 25600,
        "activity_regularizer": null,
        "W_regularizer": null,
        "output_dim": 100,
        "b_constraint": null,
        "name": "dense_1"
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "p": 0.5,
        "name": "dropout_1",
        "trainable": true
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "W_constraint": null,
        "bias": true,
        "b_regularizer": null,
        "trainable": true,
        "activation": "relu",
        "init": "glorot_uniform",
        "input_dim": 100,
        "activity_regularizer": null,
        "W_regularizer": null,
        "output_dim": 50,
        "b_constraint": null,
        "name": "dense_2"
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "p": 0.5,
        "name": "dropout_2",
        "trainable": true
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "W_constraint": null,
        "bias": true,
        "b_regularizer": null,
        "trainable": true,
        "activation": "relu",
        "init": "glorot_uniform",
        "input_dim": 50,
        "activity_regularizer": null,
        "W_regularizer": null,
        "output_dim": 10,
        "b_constraint": null,
        "name": "dense_3"
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "p": 0.5,
        "name": "dropout_3",
        "trainable": true
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "W_constraint": null,
        "bias": true,
        "b_regularizer": null,
        "trainable": true,
        "activation": "tanh",
        "init": "glorot_uniform",
        "input_dim": 10,
        "activity_regularizer": null,
        "W_regularizer": null,
        "output_dim": 1,
        "b_constraint": null,
        "name": "dense_4"
      },
      "class_name": "Dense"
    }
  ],
  "class_name": "Sequential",
  "keras_version": "1.2.1"
}